// Написать программу вычисления значения функции y = f(a)

Console.WriteLine("Input a to find its function");

int a = int.Parse(Console.ReadLine());

int y = 2*a; // Как я понял функцией может быть любое математическое действие. (или как?) У меня  2*a это функция f(a)

Console.WriteLine(y);




